micromodelOilWater/0/alpha.oil.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

fraction   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $fraction;
    }
    outlet
    {
        type            zeroGradient;

    }
    walls
    {
        type            zeroGradient;
    }
       frontAndBack
    {
        type            zeroGradient;
    }	
}

// ************************************************************************* //
